[
{"titulo": "LimitedDifferences", "categoria": "[\"Greedy\", \"SimpleMath\", \"Sorting\"]", "dificultad": "Medio", "enunciado": " Given a sequence S of numbers, its difference sequence D(S) is obtained by writing down the absolute difference between each pair of consecutive elements of S. Note that the length of D(S) is always one less than the length of S.   For example, if S = {10, 50, 50, 40, 30}, we have |10-50| = 40, |50-50| = 0, |50-40| = 10 and |40-30| = 10, thus D(S) = {40, 0, 10, 10}.    You are given N and V.   Arrange the integers from 1 to N into a sequence S such that D(S) will contain exactly V distinct values.   Return the answer as a int[]. If multiple valid solutions exist, any one of them will be accepted. If there is no valid solution, return an empty int[] instead. ", "pruebas": "[[\"7\", \"1\", \"Returns: {7, 6, 5, 4, 3, 2, 1 }\"], [\"8\", \"2\", \"Returns: {1, 5, 6, 7, 8, 4, 3, 2 }\"], [\"5\", \"2\", \"Returns: {2, 4, 1, 3, 5 }\"], [\"15\", \"5\", \"Returns: {11, 14, 12, 10, 8, 3, 7, 4, 2, 6, 1, 9, 5, 13, 15 }\"], [\"3\", \"2\", \"Returns: {1, 3, 2 }\"]]", "url": "https://community.topcoder.com/stat?c=problem_statement&pm=16989"},
{"titulo": "MarriageAndChargingChallenge", "categoria": "[\"BruteForce\"]", "dificultad": "Medio", "enunciado": " One of the challenges that comes with a marriage ceremony is charging phones. Our fortunate bride is always busy, people always call her and her phone always needs to be recharged. In this problem you will have to help her.    The bride is about to enter the wedding forum. The wedding forum is circular. Along its circumference there is a walkway. The walkway is exactly forumLength meters long.   We will introduce a coordinate system for the walkway. One designated spot will have the coordinate 0. All other points on the walkway will have increasing coordinates as you go around the forum clockwise. For example, if your current coordinate is forumLength-2 and you start walking in clockwise direction, after two meters you will be back at coordinate 0.    There are N dear relatives of the bride sitting around the forum. The relatives are numbered from 0 to N-1 in the order in which they are sitting. Relative number i is located at the coordinate relative[i].   Each relative wants to greet the bride and talk to her for some amount of time. The bride can talk to the relative when she is at the relative's coordinate. As long as they talk, the bride can also charge her cell phone. The greeting with relative i can last for at most greeting[i] seconds. Charging the cellphone for X seconds gives it enough charge to survive for X more meters of the bride's walk.    The bride will enter the forum with a completely empty battery in her cell phone. Once she enters, she is expected to walk one complete loop around the forum in clockwise direction, eventually returning back to the spot where she started. During the loop she may stop to greet relatives and recharge her cell phone as many times as she wants. Can she do it in such a way that her phone always has some charge while she's walking?   The bride can choose any entrance she wants to enter the forum. More precisely, she can start her walk at any coordinate. Count all locations from which it is possible to complete the loop in such a way that she never walks with a cell phone that is completely out of charge. Return the number of such locations. ", "pruebas": "[[\"1000\", \"{100, 300, 500, 700, 900}\", \"{200, 200, 200, 200, 200}\", \"Returns: 5\"], [\"1000\", \"{0, 42}\", \"{1234567, 47}\", \"Returns: 1\"], [\"1000000000\", \"{123456, 7890123, 456789012}\", \"{222222222, 333333333, 444444444}\", \"Returns: 0\"], [\"1\", \"{0}\", \"{1}\", \"Returns: 1\"], [\"1000000\", \"{42, 47}\", \"{6, 999994}\", \"Returns: 1\"]]", "url": "https://community.topcoder.com/stat?c=problem_statement&pm=16265"},
{"titulo": "BallotCounting", "categoria": "[\"SimpleMath\", \"SimpleSearch\", \"Iteration\"]", "dificultad": "Facil", "enunciado": " An election has just finished. There were two candidates: A and B. Each voter voted for one of the two candidates. The winner will be the candidate who received more votes. Thus, there are three possibilities for the outcome: A won, B won, or the election is a tie.   You are a journalist who observes the election committee. Your task is to report the outcome of the election as quickly as possible.    The votes cast are given in the String votes: each 'A' is a vote for candidate A and each 'B' is a vote for candidate B. You know the total number of votes cast (i.e., the length of the string votes).   The election committee is ing the votes in the order in which they are given in the string. Luckily, you just realized that you probably won't have to be there until the very end. It is quite likely that you will already know the outcome of the election before the last vote has been ed.   For example, suppose the votes cast are votes = \"AABAABAAB\". The election committee will  the votes in this order: one vote for A, another vote for A, then a vote for B, and so on. After they  the first seven votes (\"AABAABA\") you will already know the election result. (Candidate A is leading with five votes to two, and the remaining two votes can no longer change the winner of the election.)    Return the smallest X such that the result of the election will be known after the first X votes have been ed. ", "pruebas": "[[\"\\\"AAAAABBBBB\\\"\", \"Returns: 10\"], [\"\\\"AAAAABBBBA\\\"\", \"Returns: 10\"], [\"\\\"AAAAA\\\"\", \"Returns: 3\"], [\"\\\"AAAAAA\\\"\", \"Returns: 4\"], [\"\\\"AABAABAAB\\\"\", \"Returns: 7\"], [\"\\\"BABABBB\\\"\", \"Returns: 6\"]]", "url": "https://community.topcoder.com/stat?c=problem_statement&pm=16831"},
{"titulo": "MarriageAndTravelingChallenge", "categoria": "[\"BruteForce\", \"SimpleSearch\", \"Iteration\"]", "dificultad": "Facil", "enunciado": " One of the challenges after marriage is traveling to have a great honeymoon. An inseparable part of such travel is hiking in the mountains.   When you shout in the mountains, you can sometimes hear an echo. The echo will say the same thing but it will make it sound longer.   In this problem, we will assume that the echo will repeat the i-th letter of your word i times. (Here we number the letters starting from 1 for the leftmost letter.)   For example, if you say \"salam\", the echo will say \"saalllaaaammmmm\".    The fortunate groom has just heard an echo. You are given the sound he heard as a string S of lowercase English letters. It is guaranteed that S was produced from the original word in the way described above. Please determine and return the original word that was said. ", "pruebas": "[[\"\\\"saalllaaaammmmm\\\"\", \"Returns: \\\"salam\\\"\"], [\"\\\"z\\\"\", \"Returns: \\\"z\\\"\"], [\"\\\"aaa\\\"\", \"Returns: \\\"aa\\\"\"]]", "url": "https://community.topcoder.com/stat?c=problem_statement&pm=16905"}
][
{"titulo": "GoldTransfer", "categoria": "[\"binary search\", \"data structures\", \"dp\", \"greedy\", \"interactive\", \"trees\"]", "dificultad": "Dificil", "enunciado": "You are given a rooted tree. Each vertex contains a_i tons of gold, which costs c_i per one ton. Initially, the tree consists only a root numbered 0 with a_0 tons of gold and price c_0 per ton.There are q queries. Each query has one of two types:  Add vertex i (where i is an index of query) as a son to some vertex p_i; vertex i will have a_i tons of gold with c_i per ton. It's guaranteed that c_i > c_{p_i}.  For a given vertex v_i consider the simple path from v_i to the root. We need to purchase w_i tons of gold from vertices on this path, spending the minimum amount of money. If there isn't enough gold on the path, we buy all we can. If we buy x tons of gold in some vertex v the remaining amount of gold in it decreases by x (of course, we can't buy more gold that vertex has at the moment). For each query of the second type, calculate the resulting amount of gold we bought and the amount of money we should spend.Note that you should solve the problem in online mode. It means that you can't read the whole input at once. You can read each query only after writing the answer for the last query, so don't forget to flush output after printing answers. You can use functions like fflush(stdout) in C++ and BufferedWriter.flush in Java or similar after each writing in your program. In standard (if you don't tweak I/O), endl flushes cout in C++ and System.out.println in Java (or println in Kotlin) makes automatic flush as well. ", "pruebas": "[[\"\\n5 5 2\\n2 0 2\\n1 0 3 4\\n2 2 4\\n1 0 1 3\\n2 4 2\\n\", \"Returns: \\n2 4\\n4 10\\n1 3\\n\"]]", "url": "https://codeforces.com//problemset/problem/1535/E"},
{"titulo": "OmkarandCircle", "categoria": "[\"brute force\", \"dp\", \"games\", \"greedy\"]", "dificultad": "Dificil", "enunciado": "Danny, the local Math Maniac, is fascinated by circles, Omkar's most recent creation. Help him solve this circle problem!You are given n nonnegative integers a_1, a_2, \\dots, a_n arranged in a circle, where n must be odd (ie. n-1 is divisible by 2). Formally, for all i such that 2 \\leq i \\leq n, the elements a_{i - 1} and a_i are considered to be adjacent, and a_n and a_1 are also considered to be adjacent. In one operation, you pick a number on the circle, replace it with the sum of the two elements adjacent to it, and then delete the two adjacent elements from the circle. This is repeated until only one number remains in the circle, which we call the circular value.Help Danny find the maximum possible circular value after some sequences of operations. ", "pruebas": "[[\"\\n3\\n7 10 2\\n\", \"Returns: \\n17\\n\"], [\"\\n1\\n4\\n\", \"Returns: \\n4\\n\"]]", "url": "https://codeforces.com//problemset/problem/1372/D"},
{"titulo": "MSTUnification", "categoria": "[\"binary search\", \"dsu\", \"graphs\", \"greedy\"]", "dificultad": "Dificil", "enunciado": "You are given an undirected weighted connected graph with n vertices and m edges without loops and multiple edges.The i-th edge is e_i = (u_i, v_i, w_i); the distance between vertices u_i and v_i along the edge e_i is w_i (1 \\le w_i). The graph is connected, i. e. for any pair of vertices, there is at least one path between them consisting only of edges of the given graph.A minimum spanning tree (MST) in case of positive weights is a subset of the edges of a connected weighted undirected graph that connects all the vertices together and has minimum total cost among all such subsets (total cost is the sum of costs of chosen edges).You can modify the given graph. The only operation you can perform is the following: increase the weight of some edge by 1. You can increase the weight of each edge multiple (possibly, zero) times.Suppose that the initial MST cost is k. Your problem is to increase weights of some edges with minimum possible number of operations in such a way that the cost of MST in the obtained graph remains k, but MST is unique (it means that there is only one way to choose MST in the obtained graph).Your problem is to calculate the minimum number of operations required to do it.", "pruebas": "[[\"\\n8 10\\n1 2 1\\n2 3 2\\n2 4 5\\n1 4 2\\n6 3 3\\n6 1 3\\n3 5 2\\n3 7 1\\n4 8 1\\n6 2 4\\n\", \"Returns: \\n1\\n\"], [\"\\n4 3\\n2 1 3\\n4 3 4\\n2 4 1\\n\", \"Returns: \\n0\\n\"], [\"\\n3 3\\n1 2 1\\n2 3 2\\n1 3 3\\n\", \"Returns: \\n0\\n\"], [\"\\n3 3\\n1 2 1\\n2 3 3\\n1 3 3\\n\", \"Returns: \\n1\\n\"], [\"\\n1 0\\n\", \"Returns: \\n0\\n\"], [\"\\n5 6\\n1 2 2\\n2 3 1\\n4 5 3\\n2 4 2\\n1 4 2\\n1 5 3\\n\", \"Returns: \\n2\\n\"]]", "url": "https://codeforces.com//problemset/problem/1108/F"},
{"titulo": "FamilyPhotos", "categoria": "[\"games\", \"greedy\"]", "dificultad": "Dificil", "enunciado": "Alice and Bonnie are sisters, but they don't like each other very much. So when some old family photos were found in the attic, they started to argue about who should receive which photos. In the end, they decided that they would take turns picking photos. Alice goes first.There are  stacks of photos. Each stack contains exactly two photos. In each turn, a player may take only a photo from the top of one of the stacks.Each photo is described by two non-negative integers  and , indicating that it is worth  units of happiness to Alice and  units of happiness to Bonnie. Values of  and  might differ for different photos.It's allowed to pass instead of taking a photo. The game ends when all photos are taken or both players pass consecutively.The players don't act to maximize their own happiness. Instead, each player acts to maximize the amount by which her happiness exceeds her sister's. Assuming both players play optimal, find the difference between Alice's and Bonnie's happiness. That is, if there's a perfectly-played game such that Alice has  happiness and Bonnie has  happiness at the end, you should print  - .", "pruebas": "[[\"2\", \"12 3 4 7\", \"1 15 9 1\", \"Returns: 1\"], [\"2\", \"5 4 8 8\", \"4 12 14 0\", \"Returns: 4\"], [\"1\", \"0 10 0 10\", \"Returns: -10\"]]", "url": "https://codeforces.com//problemset/problem/725/F"},
{"titulo": "Sheep", "categoria": "[\"binary search\", \"greedy\"]", "dificultad": "Dificil", "enunciado": "Information technologies are developing and are increasingly penetrating into all spheres of human activity. Incredible as it is, the most modern technology are used in farming!A large farm has a meadow with grazing sheep. Overall there are  sheep and each of them contains a unique number from 1 to  — because the sheep need to be distinguished and you need to remember information about each one, and they are so much alike! The meadow consists of infinite number of regions numbered from 1 to infinity. It's known that sheep  likes regions from  to .There are two shepherds taking care of the sheep: First and Second. First wakes up early in the morning and leads the sheep graze on the lawn. Second comes in the evening and collects all the sheep.One morning, First woke up a little later than usual, and had no time to lead the sheep graze on the lawn. So he tied together every two sheep if there is a region they both like. First thought that it would be better — Second would have less work in the evening, because sheep won't scatter too much, being tied to each other!In the evening Second came on the lawn, gathered the sheep and tried to line them up in a row. But try as he might, the sheep wouldn't line up as Second want! Second had neither the strength nor the ability to untie the sheep so he left them as they are, but with one condition: he wanted to line up the sheep so that the maximum distance between two tied sheep was as small as possible. The distance between the sheep is the number of sheep in the ranks that are between these two.Help Second find the right arrangement.", "pruebas": "[[\"3\", \"1 3\", \"5 7\", \"2 4\", \"Returns: 1 3 2\"], [\"5\", \"1 5\", \"2 4\", \"3 6\", \"1 7\", \"2 6\", \"Returns: 2 1 3 5 4\"], [\"4\", \"1 3\", \"4 6\", \"5 7\", \"2 3\", \"Returns: 1 4 2 3\"]]", "url": "https://codeforces.com//problemset/problem/309/E"}
]